"""
@crop_position.py
@brief 切り出し範囲を定義する

@author Shunsuke Hishida / created on 2020/09/27
"""

class CropPosition(object):
    """
    @brief 切り出し範囲を定義する
    """
    #球団フラグの切り出し位置
    TEAM_FLAG = [648, 224, 732, 284]

    #選手名の切り出し位置
    # PLAYER_NAME = [411, 222, 638, 283]
    PLAYER_NAME = [420, 223, 629, 283]

    #背番号
    UNIFORM_NUMBER = [762, 225, 839, 282]

    # 守備位置／適性
    APTITUDE = [434, 320, 587, 363]

    # 適性メイン
    MAIN_APTITUDE = [609, 314, 666, 367]

    #守備位置
    DEFENCE_LOCATION = [605, 309, 765, 374]

    #弾道
    BALLISTIC = [758, 405, 809, 465]

    #ミート
    MEET = [729, 479, 807, 540]

    #パワー
    POWER = [729, 553, 807, 614]

    #走力
    RUN = [729, 627, 807, 688]

    #肩力
    SHOULDER = [729, 701, 807, 762]

    #守備力
    DEFENCE = [729, 775, 807, 836]

    #捕球
    CATCHING = [729, 848, 807, 909]

    #利き投げ
    DOMINANT_THROW = [1620, 314, 1670, 372]

    #利き打ち
    DOMINANT_BAT = [1708, 314, 1758, 372]

    #ページ判断用
    CHAN_PIN_USAGE = [878, 414, 1062, 472]

    #チャンス、ピンチ
    CHAN_PINCH = [1063, 415, 1104, 473]

    #対左投手、対左打者
    VER_LEFT = [1294, 415, 1335, 473]

    #キャッチャー、打たれ強さ
    CATCHER_STRENGTH = [1527, 415, 1568, 473]

    #怪我しにくさ
    INJ_TOLE = [1759, 415, 1800, 473]

    #盗塁、ノビ
    STEAL_NOBI = [1063, 475, 1104, 533]

    #走塁、クイック
    RUN_QUICK = [1294, 475, 1335, 533]

    #送球
    THROW = [1527, 475, 1568, 533]

    #回復
    RECOVERY = [1759, 475, 1800, 533]

    #特殊能力
    SP_ABILITY_LIST = [[879, 546, 1101, 597], [1111, 546, 1333, 597], [1342, 546, 1564, 597], [1574, 546, 1796, 597],
                        [879, 606, 1101, 657], [1111, 606, 1333, 657], [1342, 606, 1564, 657], [1574, 606, 1796, 657],
                        [879, 666, 1101, 717], [1111, 666, 1333, 717], [1342, 666, 1564, 717], [1574, 666, 1796, 717],
                        [879, 726, 1101, 777], [1111, 726, 1333, 777], [1342, 726, 1564, 777], [1574, 726, 1796, 777],
                        [879, 786, 1101, 837], [1111, 786, 1333, 837], [1342, 786, 1564, 837], [1574, 786, 1796, 837],
                        [879, 846, 1101, 897], [1111, 846, 1333, 897], [1342, 846, 1564, 897], [1574, 846, 1796, 897]]